Revit 2018 API
BasicFileInfo Class
 Encapsulates basic information about a Revit file, including worksharing status, Revit version, username and central path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
public class BasicFileInfo : IDisposable
Visual Basic
Public Class BasicFileInfo _
	Implements IDisposable
Visual C++
public ref class BasicFileInfo : IDisposable
Remarks
 This class provides a fast access to get basic information without fully opening a Revit file. The Extract method can initialize a new instance of this class by providing a full path for Revit file, including project (.rvt) and family (.rfa) files. It's the only way to initialize this class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BasicFileInfo
See Also
BasicFileInfo Members
Autodesk.Revit.DB Namespace